app/controllers/books_controller.rb

INSERT INTO "books" ("title", "created_at", "updated_at", "author") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Bad Book"], ["created_at", "2022-09-15 17:50:00.478942"], ["updated_at", "2022-09-15 17:50:00.478942"], ["author", "Rishav"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save